results/unused/fabio-512-run01/003_fio/cmd_366.output
libaio-reference: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=libaio, iodepth=8
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666752671,
  "timestamp_ms" : 1666752671349,
  "time" : "Wed Oct 26 04:51:11 2022",
  "jobs" : [
    {
      "jobname" : "libaio-reference",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "libaio-reference",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "8",
        "bs" : "512",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "libaio",
        "filename" : "/dev/nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 1046752768,
        "io_kbytes" : 1022219,
        "bw_bytes" : 149514750,
        "bw" : 146010,
        "iops" : 292019.854307,
        "runtime" : 7001,
        "total_ios" : 2044431,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1403,
          "max" : 123251,
          "mean" : 2715.633511,
          "stddev" : 1330.313775,
          "N" : 2044432
        },
        "clat_ns" : {
          "min" : 2605,
          "max" : 145643,
          "mean" : 24432.144750,
          "stddev" : 3169.438036,
          "N" : 2044438,
          "percentile" : {
            "1.000000" : 17536,
            "5.000000" : 22400,
            "10.000000" : 22656,
            "20.000000" : 22656,
            "30.000000" : 22912,
            "40.000000" : 23680,
            "50.000000" : 23936,
            "60.000000" : 24448,
            "70.000000" : 24960,
            "80.000000" : 25472,
            "90.000000" : 25728,
            "95.000000" : 29312,
            "99.000000" : 37632,
            "99.500000" : 41728,
            "99.900000" : 52992,
            "99.950000" : 65280,
            "99.990000" : 79360
          }
        },
        "lat_ns" : {
          "min" : 10781,
          "max" : 148709,
          "mean" : 27147.777613,
          "stddev" : 3031.587372,
          "N" : 2044438
        },
        "bw_min" : 145798,
        "bw_max" : 146766,
        "bw_agg" : 100.000000,
        "bw_mean" : 146077.000000,
        "bw_dev" : 239.693394,
        "bw_samples" : 14,
        "iops_min" : 291596,
        "iops_max" : 293532,
        "iops_mean" : 292154.142857,
        "iops_stddev" : 479.286466,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 38.614286,
      "sys_cpu" : 60.157143,
      "ctx" : 10093,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 100.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999951,
        "8" : 0.100000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.010000,
        "10" : 0.010000,
        "20" : 2.060720,
        "50" : 97.807507,
        "100" : 0.119887,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 8,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "nvme0n1",
      "read_ios" : 2933310,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 16349,
      "write_ticks" : 0,
      "in_queue" : 16349,
      "util" : 99.098564
    }
  ]
}

libaio-reference: (groupid=0, jobs=1): err= 0: pid=143970: Wed Oct 26 04:51:11 2022
  read: IOPS=292k, BW=143MiB/s (150MB/s)(998MiB/7001msec)
    slat (nsec): min=1403, max=123251, avg=2715.63, stdev=1330.31
    clat (usec): min=2, max=145, avg=24.43, stdev= 3.17
     lat (usec): min=10, max=148, avg=27.15, stdev= 3.03
    clat percentiles (nsec):
     |  1.00th=[17536],  5.00th=[22400], 10.00th=[22656], 20.00th=[22656],
     | 30.00th=[22912], 40.00th=[23680], 50.00th=[23936], 60.00th=[24448],
     | 70.00th=[24960], 80.00th=[25472], 90.00th=[25728], 95.00th=[29312],
     | 99.00th=[37632], 99.50th=[41728], 99.90th=[52992], 99.95th=[65280],
     | 99.99th=[79360]
   bw (  KiB/s): min=145798, max=146766, per=100.00%, avg=146077.00, stdev=239.69, samples=14
   iops        : min=291596, max=293532, avg=292154.14, stdev=479.29, samples=14
  lat (usec)   : 4=0.01%, 10=0.01%, 20=2.06%, 50=97.81%, 100=0.12%
  lat (usec)   : 250=0.01%
  cpu          : usr=38.61%, sys=60.16%, ctx=10093, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2044431,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=143MiB/s (150MB/s), 143MiB/s-143MiB/s (150MB/s-150MB/s), io=998MiB (1047MB), run=7001-7001msec

Disk stats (read/write):
  nvme0n1: ios=2933310/0, merge=0/0, ticks=16349/0, in_queue=16349, util=99.10%